ZigEmbeddedGroup/microzig/port/wch/ch32v/src/chips/ch32v003.svd
      </registers>
    </peripheral>
	<peripheral>
      <name>PFIC</name>
      <description>Programmable Fast Interrupt
      Controller</description>
      <groupName>PFIC</groupName>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1100</size>					
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ISR1</name>
          <displayName>ISR1</displayName>
          <description>Interrupt Status
          Register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000000C</resetValue>
          <fields>
			<field>
              <name>INTENSTA2_3</name>
              <description>Interrupt ID Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INTENSTA12</name>
              <description>Interrupt ID Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTENSTA14</name>
              <description>Interrupt ID Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTENSTA16_31</name>
              <description>Interrupt ID Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR2</name>
          <displayName>ISR2</displayName>
          <description>Interrupt Status
          Register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTENSTA</name>
              <description>Interrupt ID Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR1</name>
          <displayName>IPR1</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
		  <field>
              <name>PENDSTA2_3</name>
              <description>PENDSTA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PENDSTA12</name>
              <description>PENDSTA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTENSTA14</name>
              <description>PENDSTA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTENSTA16_31</name>
              <description>PENDSTA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR2</name>
          <displayName>IPR2</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDSTA32_38</name>
              <description>PENDSTA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITHRESDR</name>
          <displayName>ITHRESDR</displayName>
          <description>Interrupt Priority
          Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>THRESHOLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Interrupt Config Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>        
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>RSTSYS</name>
              <description>RESET System</description>
			   <access>write-only</access>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			</field>
			<field>
              <name>KEYCODE</name>
              <description>KEYCODE</description>
			   <access>write-only</access>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GISR</name>
          <displayName>GISR</displayName>
          <description>Interrupt Global Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NESTSTA</name>
              <description>NESTSTA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
		       <field>
              <name>GACTSTA</name>
              <description>GACTSTA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>GPENDSTA</name>
              <description>GPENDSTA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>VTFIDR</name>
          <displayName>VTFIDR</displayName>
          <description>ID Config Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VTFID0</name>
              <description>VTFID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
		        <field>
              <name>VTFID1</name>
              <description>VTFID1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VTFADDRR0</name>
          <displayName>VTFADDRR0</displayName>
          <description>Interrupt 0 address
          Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VTF0EN</name>
              <description>VTF0EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name> ADDR0</name>
              <description> ADDR0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VTFADDRR1</name>
          <displayName>VTFADDRR1</displayName>
          <description>Interrupt 1 address
          Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VTF1EN</name>
              <description>VTF1EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name> ADDR1</name>
              <description> ADDR1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IENR1</name>
          <displayName>IENR1</displayName>
          <description>Interrupt Setting Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEN12</name>
              <description>INTEN12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN14</name>
              <description>INTEN14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN16_31</name>
              <description>INTEN16_31</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
		 <register>
          <name>IENR2</name>
          <displayName>IENR2</displayName>
          <description>Interrupt Setting Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEN</name>
              <description>INTEN32_38</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		 <register>
          <name>IRER1</name>
          <displayName>IRER1</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTRSET12</name>
              <description>INTRSET12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTRSET14</name>
              <description>INTRSET14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>INTRSET16_31</name>
              <description>INTRSET16_31</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IRER2</name>
          <displayName>IRER2</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTRSET38_32</name>
              <description>INTRSET38_32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPSR1</name>
          <displayName>IPSR1</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDSET2_3</name>
              <description>PENDSET</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PENDSET12</name>
              <description>PENDSET</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDSET14</name>
              <description>PENDSET</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDSET16_31</name>
              <description>PENDSET</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPSR2</name>
          <displayName>IPSR2</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDSET32_38</name>
              <description>PENDSET32_38</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPRR1</name>
          <displayName>IPRR1</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST2_3</name>
              <description>PENDRESET</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PENDRST12</name>
              <description>PENDRESET</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDRST14</name>
              <description>PENDRESET</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDRST16_31</name>
              <description>PENDRESET</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPRR2</name>
          <displayName>IPRR2</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST32_38</name>
              <description>PENDRESET32_38</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IACTR1</name>
          <displayName>IACTR1</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS2_3</name>
              <description>IACTS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IACTS12</name>
              <description>IACTS</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IACTS14</name>
              <description>IACTS</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IACTS16_31</name>
              <description>IACTS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IACTR2</name>
          <displayName>IACTR2</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS</name>
              <description>IACTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPRIOR0</name>
          <displayName>IPRIOR0</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR1</name>
          <displayName>IPRIOR1</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x401</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR2</name>
          <displayName>IPRIOR2</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x402</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR3</name>
          <displayName>IPRIOR3</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x403</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR4</name>
          <displayName>IPRIOR4</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR5</name>
          <displayName>IPRIOR5</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x405</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR6</name>
          <displayName>IPRIOR6</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x406</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR7</name>
          <displayName>IPRIOR7</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x407</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR8</name>
          <displayName>IPRIOR8</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR9</name>
          <displayName>IPRIOR9</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x409</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR10</name>
          <displayName>IPRIOR10</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x40A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

		<register>
          <name>IPRIOR11</name>
          <displayName>IPRIOR11</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x40B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR12</name>
          <displayName>IPRIOR12</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR13</name>
          <displayName>IPRIOR13</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x40D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR14</name>
          <displayName>IPRIOR14</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x40E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR15</name>
          <displayName>IPRIOR15</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x40F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR16</name>
          <displayName>IPRIOR6</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR17</name>
          <displayName>IPRIOR7</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x411</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR18</name>
          <displayName>IPRIOR8</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x412</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR19</name>
          <displayName>IPRIOR9</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x413</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
